pycom/pycom-micropython-sigfox/esp32/mods/modpycom.c
STATIC mp_obj_t mod_pycom_ota_slot (void) {
    int ota_slot = updater_ota_next_slot_address();
    return mp_obj_new_int(ota_slot);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_0(mod_pycom_ota_slot_obj, mod_pycom_ota_slot);

STATIC mp_obj_t mod_pycom_diff_update_enabled (void) {
#ifdef DIFF_UPDATE_ENABLED
    return mp_obj_new_bool(true);
#else
    return mp_obj_new_bool(false);
#endif
}
STATIC MP_DEFINE_CONST_FUN_OBJ_0(mod_pycom_diff_update_enabled_obj, mod_pycom_diff_update_enabled);

STATIC mp_obj_t mod_pycom_pulses_get (mp_obj_t gpio, mp_obj_t timeout) {
    rmt_config_t rmt_rx;
    rmt_rx.channel = RMT_CHANNEL_0;
    rmt_rx.gpio_num = pin_find(gpio)->pin_number;
    rmt_rx.clk_div = 80;
    rmt_rx.mem_block_num = 1;
    rmt_rx.rmt_mode = RMT_MODE_RX;
    rmt_rx.rx_config.filter_en = true;
    rmt_rx.rx_config.filter_ticks_thresh = 100;
    rmt_rx.rx_config.idle_threshold = 0xFFFF;
    rmt_config(&rmt_rx);

    RingbufHandle_t rb = NULL;
    mp_obj_t pulses_l = mp_obj_new_list(0, NULL);

    // get the RMT RX ringbuffer
    rmt_get_ringbuf_handle(RMT_CHANNEL_0, &rb);
    rmt_rx_start(RMT_CHANNEL_0, 1);

    size_t rx_size = 0;
    rmt_item32_t* item = (rmt_item32_t*) xRingbufferReceive(rb, &rx_size, mp_obj_get_int(timeout));
    if (item) {
        for (int i = 0; i < rx_size / 4; i++) {
            mp_obj_t tuple[2];
            tuple[0] = mp_obj_new_int(item[i].level0);
            tuple[1] = mp_obj_new_int(item[i].duration0);
            mp_obj_list_append(pulses_l, mp_obj_new_tuple(2, tuple));

            tuple[0] = mp_obj_new_int(item[i].level1);
            tuple[1] = mp_obj_new_int(item[i].duration1);
            mp_obj_list_append(pulses_l, mp_obj_new_tuple(2, tuple));
        }

        // after parsing the data, return spaces to ringbuffer.
        vRingbufferReturnItem(rb, (void*) item);
    }

    rmt_rx_stop(RMT_CHANNEL_0);

    return pulses_l;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_2(mod_pycom_pulses_get_obj, mod_pycom_pulses_get);


STATIC mp_obj_t mod_pycom_nvs_set (mp_obj_t _key, mp_obj_t _value) {

    const char *key = mp_obj_str_get_str(_key);
    esp_err_t esp_err = ESP_OK;

    if (MP_OBJ_IS_STR_OR_BYTES(_value)) {
        const char *value = mp_obj_str_get_str(_value);
        if (strlen(value) >= 1984) {
            // Maximum length (including null character) can be 1984 bytes
            nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "value too long (max: 1984)"));
        }
        esp_err = nvs_set_str(pycom_nvs_handle, key, value);
    } else if(MP_OBJ_IS_INT(_value)) {
        uint32_t value = mp_obj_get_int_truncated(_value);
        esp_err = nvs_set_u32(pycom_nvs_handle, key, value);
    } else {
        nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "Value must be string, bytes or integer"));
    }

    if (ESP_OK == esp_err) {
        nvs_commit(pycom_nvs_handle);
    } else if (ESP_ERR_NVS_NOT_ENOUGH_SPACE == esp_err || ESP_ERR_NVS_PAGE_FULL == esp_err || ESP_ERR_NVS_NO_FREE_PAGES == esp_err) {
        nlr_raise(mp_obj_new_exception_msg(&mp_type_OSError, "No free space available"));
    } else if (ESP_ERR_NVS_INVALID_NAME == esp_err) {
        nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "Key is invalid"));
    } else if (ESP_ERR_NVS_KEY_TOO_LONG == esp_err) {
        nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "Key is too long"));
    } else {
        nlr_raise(mp_obj_new_exception_msg_varg(&mp_type_Exception, "Error occurred while storing value, code: %d", esp_err));
    }
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_2(mod_pycom_nvs_set_obj, mod_pycom_nvs_set);

STATIC mp_obj_t mod_pycom_nvs_get (mp_uint_t n_args, const mp_obj_t *args) {

    const char *key = mp_obj_str_get_str(args[0]);
    esp_err_t esp_err = ESP_OK;
    mp_obj_t ret = mp_const_none;
    uint32_t value;

    esp_err = nvs_get_u32(pycom_nvs_handle, key, &value);
    if (esp_err == ESP_OK) {
        ret = mp_obj_new_int(value);
    }
    else {
        esp_err = nvs_get_str(pycom_nvs_handle, key, NULL, &value);
        if(esp_err == ESP_OK) {
            char* value_string = (char*)malloc(value);

            esp_err = nvs_get_str(pycom_nvs_handle, key, value_string, &value);

            if(esp_err == ESP_OK) {
                //do not count the terminating \0
                ret = mp_obj_new_str(value_string, value-1);
            }
            free(value_string);
        }
    }

    if(esp_err == ESP_ERR_NVS_NOT_FOUND) {
        if (n_args > 1) {
            // return user defined NoExistValue
            return args[1];
        }
        else
        {
            nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "No matching object for the provided key"));
        }
    } else if(esp_err != ESP_OK) {
        nlr_raise(mp_obj_new_exception_msg_varg(&mp_type_Exception, "Error occurred while fetching value, code: %d", esp_err));
    }

    return ret;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(mod_pycom_nvs_get_obj, 1, 2, mod_pycom_nvs_get);

STATIC mp_obj_t mod_pycom_nvs_erase (mp_obj_t _key) {
    const char *key = mp_obj_str_get_str(_key);

    if (ESP_ERR_NVS_NOT_FOUND == nvs_erase_key(pycom_nvs_handle, key)) {
        nlr_raise(mp_obj_new_exception_msg(&mp_type_KeyError, "key not found"));
    }
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(mod_pycom_nvs_erase_obj, mod_pycom_nvs_erase);

STATIC mp_obj_t mod_pycom_nvs_erase_all (void) {
    if (ESP_OK != nvs_erase_all(pycom_nvs_handle)) {
        nlr_raise(mp_obj_new_exception_msg(&mp_type_OSError, mpexception_os_operation_failed));
    }
    nvs_commit(pycom_nvs_handle);
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_0(mod_pycom_nvs_erase_all_obj, mod_pycom_nvs_erase_all);

STATIC mp_obj_t mod_pycom_wifi_on_boot (mp_uint_t n_args, const mp_obj_t *args) {
    if (n_args == 0) {
        return mp_obj_new_bool(config_get_wifi_on_boot());
    }
    if (config_get_wifi_on_boot() != mp_obj_is_true(args[0])) {
        config_set_wifi_on_boot (mp_obj_is_true(args[0]));
        if (n_args > 1 && mp_obj_is_true(args[1])) {
            if (mp_obj_is_true(args[0])) {
                mptask_config_wifi(true);
            } else {
                wlan_deinit(NULL);
            }
        }
    }
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(mod_pycom_wifi_on_boot_obj, 0, 2, mod_pycom_wifi_on_boot);

STATIC mp_obj_t mod_pycom_wifi_mode (mp_uint_t n_args, const mp_obj_t *args) {
    uint8_t mode;
    if (n_args) {
        mode = mp_obj_get_int(args[0]);
        switch(mode)
        {
            case 0:
                config_set_wifi_mode ((uint8_t)PYCOM_WIFI_CONF_MODE_NONE, true);
                break;
            case 1:
                config_set_wifi_mode ((uint8_t)PYCOM_WIFI_CONF_MODE_STA, true);
                break;
            case 2:
                config_set_wifi_mode ((uint8_t)PYCOM_WIFI_CONF_MODE_AP, true);
                break;
            case 3:
                config_set_wifi_mode ((uint8_t)PYCOM_WIFI_CONF_MODE_APSTA, true);
                break;
            default:
                break;
        }
    } else {
        mode = config_get_wifi_mode();
        switch(mode)
        {
            case PYCOM_WIFI_CONF_MODE_STA:
                return MP_OBJ_NEW_SMALL_INT(1);
            case PYCOM_WIFI_CONF_MODE_AP:
                return MP_OBJ_NEW_SMALL_INT(2);
            case PYCOM_WIFI_CONF_MODE_APSTA:
                return MP_OBJ_NEW_SMALL_INT(3);
            case PYCOM_WIFI_CONF_MODE_NONE:
            default:
                return MP_OBJ_NEW_SMALL_INT(0);
        }
    }
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(mod_pycom_wifi_mode_obj, 0, 1, mod_pycom_wifi_mode);

STATIC mp_obj_t mod_pycom_wifi_ssid_sta (mp_uint_t n_args, const mp_obj_t *args) {
    if (n_args) {
        if(args[0] == mp_const_none)
        {
            config_set_sta_wifi_ssid (NULL, true);
        }
        else if (MP_OBJ_IS_STR(args[0]))
        {
            config_set_sta_wifi_ssid ((uint8_t *)(mp_obj_str_get_str(args[0])), true);
        }
        else{/*Nothing*/}

    } else {
        uint8_t * ssid = (uint8_t *)malloc(33);
        mp_obj_t ssid_obj;
        if(config_get_wifi_sta_ssid(ssid))
        {
            ssid_obj = mp_obj_new_str((const char *)ssid, strlen((const char *)ssid));
        }
        else
        {
            ssid_obj = mp_const_none;
        }
        free(ssid);
        return ssid_obj;
    }
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(mod_pycom_wifi_ssid_sta_obj, 0, 1, mod_pycom_wifi_ssid_sta);

