pycom/pycom-micropython-sigfox/esp32/mods/modpycom.c
STATIC mp_obj_t mod_pycom_bootmgr (size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_boot_partition, ARG_fs_type, ARG_safeboot, ARG_status };
    STATIC const mp_arg_t allowed_args[] = {
            { MP_QSTR_boot_partition,   MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 255} },
            { MP_QSTR_fs_type,          MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 255} },
            { MP_QSTR_safeboot,         MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 255} },
            { MP_QSTR_reset,            MP_ARG_KW_ONLY | MP_ARG_BOOL, {.u_bool = false} },
    };

    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args, pos_args, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    if (args[ARG_boot_partition].u_int == 255 && args[ARG_fs_type].u_int == 255 && args[ARG_safeboot].u_int == 255) {
        mp_obj_tuple_t *t = MP_OBJ_TO_PTR(mp_obj_new_tuple(4, NULL));

        if(boot_info.ActiveImg == 0x00)
        {
            t->items[ARG_boot_partition] = mp_obj_new_str("Factory", strlen("Factory"));
        }
        else
        {
            t->items[ARG_boot_partition] = mp_obj_new_str("ota_0", strlen("ota_0"));
        }

        if(config_get_boot_fs_type() == 0x00)
        {
            t->items[ARG_fs_type] = mp_obj_new_str("FAT", strlen("FAT"));
        }
        else
        {
            t->items[ARG_fs_type] = mp_obj_new_str("LittleFS", strlen("LittleFS"));
        }

        if(boot_info.safeboot == 0x00)
        {
            t->items[ARG_safeboot] = mp_obj_new_str("SafeBoot: False", strlen("SafeBoot: False"));
        }
        else
        {
            t->items[ARG_safeboot] = mp_obj_new_str("SafeBoot: True", strlen("SafeBoot: True"));
        }
        if(boot_info.Status == IMG_STATUS_CHECK)
        {
            t->items[ARG_status] = mp_obj_new_str("Status: Check", strlen("Status: Check"));
        }
        else if(boot_info.Status == IMG_STATUS_READY)
        {
            t->items[ARG_status] = mp_obj_new_str("Status: Ready", strlen("Status: Ready"));
        }
        else if(boot_info.Status == IMG_STATUS_PATCH)
        {
            t->items[ARG_status] = mp_obj_new_str("Status: Patch", strlen("Status: Patch"));
        }

        return MP_OBJ_FROM_PTR(t);

    } else {
        modpycom_bootmgr(args[ARG_boot_partition].u_int, args[ARG_fs_type].u_int, args[ARG_safeboot].u_int, args[3].u_bool);
    }

    return mp_const_none;
}

STATIC MP_DEFINE_CONST_FUN_OBJ_KW(mod_pycom_bootmgr_obj, 0, mod_pycom_bootmgr);

STATIC mp_obj_t mod_pycom_get_free_heap (void) {

    size_t heap_psram_free = 0;
    mp_obj_t items[2];

    if (esp32_get_chip_rev() > 0) {
        heap_psram_free = heap_caps_get_free_size(MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    }
    items[0] = mp_obj_new_int(heap_caps_get_free_size(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT));
    if(heap_psram_free)
    {
        items[1] = mp_obj_new_int(heap_psram_free);
    }
    else
    {
        items[1] = mp_obj_new_str("NO_EXT_RAM", strlen("NO_EXT_RAM"));
    }

    return mp_obj_new_tuple(2, items);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_0(mod_pycom_get_free_heap_obj, mod_pycom_get_free_heap);

#if (VARIANT == PYBYTES)

STATIC mp_obj_t mod_pycom_pybytes_device_token (void) {
    uint8_t pybytes_device_token[39];
    config_get_pybytes_device_token(pybytes_device_token);
    return mp_obj_new_str((const char*)pybytes_device_token,strlen((const char*)pybytes_device_token));
}
STATIC MP_DEFINE_CONST_FUN_OBJ_0(mod_pycom_pybytes_device_token_obj, mod_pycom_pybytes_device_token);


STATIC mp_obj_t mod_pycom_pybytes_mqttServiceAddress (void) {
    uint8_t pybytes_mqttServiceAddress[39];
    config_get_pybytes_mqttServiceAddress(pybytes_mqttServiceAddress);
    return mp_obj_new_str((const char*)pybytes_mqttServiceAddress,strlen((const char*)pybytes_mqttServiceAddress));
}
STATIC MP_DEFINE_CONST_FUN_OBJ_0(mod_pycom_pybytes_mqttServiceAddress_obj, mod_pycom_pybytes_mqttServiceAddress);

STATIC mp_obj_t mod_pycom_pybytes_userId (void) {
    uint8_t pybytes_userId[254];
    config_get_pybytes_userId(pybytes_userId);
    return mp_obj_new_str((const char*)pybytes_userId,strlen((const char*)pybytes_userId));
}
STATIC MP_DEFINE_CONST_FUN_OBJ_0(mod_pycom_pybytes_userId_obj, mod_pycom_pybytes_userId);

STATIC mp_obj_t mod_pycom_pybytes_network_preferences (void) {
    uint8_t pybytes_network_preferences[54];
    config_get_pybytes_network_preferences(pybytes_network_preferences);
    return mp_obj_new_str((const char*)pybytes_network_preferences,strlen((const char*)pybytes_network_preferences));
}
STATIC MP_DEFINE_CONST_FUN_OBJ_0(mod_pycom_pybytes_network_preferences_obj, mod_pycom_pybytes_network_preferences);

STATIC mp_obj_t mod_pycom_pybytes_extra_preferences (void) {
    uint8_t pybytes_extra_preferences[99];
    config_get_pybytes_extra_preferences(pybytes_extra_preferences);
    return mp_obj_new_str((const char*)pybytes_extra_preferences,strlen((const char*)pybytes_extra_preferences));
}
STATIC MP_DEFINE_CONST_FUN_OBJ_0(mod_pycom_pybytes_extra_preferences_obj, mod_pycom_pybytes_extra_preferences);

STATIC mp_obj_t mod_pycom_pybytes_force_update (mp_uint_t n_args, const mp_obj_t *args) {
    if (n_args) {
        config_set_pybytes_force_update (mp_obj_is_true(args[0]));
    } else {
        return mp_obj_new_bool(config_get_pybytes_force_update());
    }
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(mod_pycom_pybytes_force_update_obj, 0, 1, mod_pycom_pybytes_force_update);

STATIC mp_obj_t mod_pycom_smartConfig (mp_uint_t n_args, const mp_obj_t *args) {
    if (n_args) {
        config_set_wifi_smart_config ((uint8_t)(mp_obj_is_true(args[0])), true);
    } else {
        return mp_obj_new_bool(config_get_wifi_smart_config());
    }
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(mod_pycom_smartConfig_obj, 0, 1, mod_pycom_smartConfig);

#endif //(VARIANT == PYBYTES)

#if defined(FIPY) || defined(LOPY4) || defined(SIPY)

// Helper function to return decimal value of a hexadecimal character coded in ASCII
STATIC uint8_t hex_from_char(const char c) {

    if((uint8_t)c >= '0' && (uint8_t)c <= '9') {
        return c - '0';
    }
    else if((uint8_t)c >= 'A' && (uint8_t)c <= 'F') {
        return c - ('A' - 10);
    }
    else if((uint8_t)c >= 'a' && (uint8_t)c <= 'f') {
        return c - ('a' - 10);
    }
    else {
        // 16 is invalid, because in hexa allowed range is 0 - 15
        return 16;
    }
}

