pycom/pycom-micropython-sigfox/esp32/mods/modpycom.c
        }
        if (args[ARG_private_key].u_obj != mp_const_none) {

            if (args[ARG_force].u_bool == true || is_empty(private_key, sizeof(private_key))) {

                const char* private_key = mp_obj_str_get_data(args[ARG_private_key].u_obj, &length);

                if(length != 32) {
                    nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "Private Key must have length of 32"));
                }

                // Put together every 2 characters of the string (which are digits from 0 - 9 and a/A - f/F) into 1 bytes because the available space is half of the required one
                for(int i = 0, j = 0; i < length; i = i+2) {
                    uint8_t lower_nibble = hex_from_char(private_key[i+1]);
                    uint8_t upper_nibble = hex_from_char(private_key[i]);

                    if(lower_nibble == 16 || upper_nibble == 16) {
                        nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "Private Key must only contain hexadecimal digits!"));
                    }

                    tmp_array[j] = lower_nibble | (upper_nibble << 4);
                    j++;
                }

                ret_val = config_set_sigfox_private_key(tmp_array);
                if (ret_val == false) {
                    nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "Failed to write private key"));
                }
            } else {
                nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "Use force option to overwrite existing private key!"));
            }
        }
        return mp_const_true;
    }
}
STATIC MP_DEFINE_CONST_FUN_OBJ_KW(mod_pycom_sigfox_info_obj, 0, mod_pycom_sigfox_info);

#endif // #if defined(FIPY) || defined(LOPY4) || defined(SIPY)

#include "utils/data_struct/list.h"
#include "ml/data_pipeline.h"
#include "ml/model.h"

STATIC mp_obj_t mod_pycom_ml_new_model (mp_obj_t model_definition) {

    const char *model_definition_str = mp_obj_str_get_str(model_definition);
    
    bool ret = new_model(model_definition_str);

    return mp_obj_new_bool(ret);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(mod_pycom_ml_new_model_obj, mod_pycom_ml_new_model);

STATIC mp_obj_t mod_pycom_ml_run_model (mp_obj_t data) {

    // Get input data.
    mp_obj_t *list;
    size_t listlen = 0;

    mp_obj_list_get(data, &listlen, &list);

    float data_buf[listlen];
    for (int i = 0 ; i < listlen ; i++){
        data_buf[i] =  mp_obj_float_get(list[i]);
    }

    // Run inference.
    List* results = run_model(data_buf, listlen);

    // Dictionary to hold results.
    mp_obj_dict_t *results_dct = mp_obj_new_dict(0);

    // For each output block, add results.
    l_for_each_entry(entry, results){

        ReturnedData *rd = (ReturnedData *) entry->data;

        mp_obj_t entry_l = mp_obj_new_list(0, NULL);

        for(int i = 0; i < rd->data->buffer_size; i++){

            mp_obj_list_append(entry_l, mp_obj_new_float(rd->data->buffer[i]));
        }

        // Add to dict.
        mp_obj_dict_store (results_dct, mp_obj_new_str(rd->block_id, strlen(rd->block_id)), entry_l);
    }

    // Free memory.
    l_delete_list(results);

    return results_dct;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(mod_pycom_ml_run_model_obj, mod_pycom_ml_run_model);


STATIC const mp_map_elem_t pycom_module_globals_table[] = {
        { MP_OBJ_NEW_QSTR(MP_QSTR___name__),                        MP_OBJ_NEW_QSTR(MP_QSTR_pycom) },
        { MP_OBJ_NEW_QSTR(MP_QSTR_heartbeat),                       (mp_obj_t)&mod_pycom_heartbeat_obj },
        { MP_OBJ_NEW_QSTR(MP_QSTR_rgbled),                          (mp_obj_t)&mod_pycom_rgb_led_obj },
        { MP_OBJ_NEW_QSTR(MP_QSTR_ota_start),                       (mp_obj_t)&mod_pycom_ota_start_obj },
        { MP_OBJ_NEW_QSTR(MP_QSTR_ota_write),                       (mp_obj_t)&mod_pycom_ota_write_obj },
        { MP_OBJ_NEW_QSTR(MP_QSTR_ota_finish),                      (mp_obj_t)&mod_pycom_ota_finish_obj },
        { MP_OBJ_NEW_QSTR(MP_QSTR_ota_verify),                      (mp_obj_t)&mod_pycom_ota_verify_obj },
        { MP_OBJ_NEW_QSTR(MP_QSTR_ota_slot),                        (mp_obj_t)&mod_pycom_ota_slot_obj },
        { MP_OBJ_NEW_QSTR(MP_QSTR_diff_update_enabled),             (mp_obj_t)&mod_pycom_diff_update_enabled_obj },
        { MP_OBJ_NEW_QSTR(MP_QSTR_pulses_get),                      (mp_obj_t)&mod_pycom_pulses_get_obj },
        { MP_OBJ_NEW_QSTR(MP_QSTR_nvs_set),                         (mp_obj_t)&mod_pycom_nvs_set_obj },
        { MP_OBJ_NEW_QSTR(MP_QSTR_nvs_get),                         (mp_obj_t)&mod_pycom_nvs_get_obj },
        { MP_OBJ_NEW_QSTR(MP_QSTR_nvs_erase),                       (mp_obj_t)&mod_pycom_nvs_erase_obj },
        { MP_OBJ_NEW_QSTR(MP_QSTR_nvs_erase_all),                   (mp_obj_t)&mod_pycom_nvs_erase_all_obj },
        { MP_OBJ_NEW_QSTR(MP_QSTR_wifi_on_boot),                    (mp_obj_t)&mod_pycom_wifi_on_boot_obj },
        { MP_OBJ_NEW_QSTR(MP_QSTR_wdt_on_boot),                     (mp_obj_t)&mod_pycom_wdt_on_boot_obj },
        { MP_OBJ_NEW_QSTR(MP_QSTR_wdt_on_boot_timeout),             (mp_obj_t)&mod_pycom_wdt_on_boot_timeout_obj },
        { MP_OBJ_NEW_QSTR(MP_QSTR_heartbeat_on_boot),               (mp_obj_t)&mod_pycom_heartbeat_on_boot_obj },
        { MP_OBJ_NEW_QSTR(MP_QSTR_lte_modem_en_on_boot),            (mp_obj_t)&mod_pycom_lte_modem_on_boot_obj },
        { MP_OBJ_NEW_QSTR(MP_QSTR_get_free_heap),                   (mp_obj_t)&mod_pycom_get_free_heap_obj },
        { MP_OBJ_NEW_QSTR(MP_QSTR_wifi_ssid_sta),                   (mp_obj_t)&mod_pycom_wifi_ssid_sta_obj },
        { MP_OBJ_NEW_QSTR(MP_QSTR_wifi_ssid_ap),                    (mp_obj_t)&mod_pycom_wifi_ssid_ap_obj },
        { MP_OBJ_NEW_QSTR(MP_QSTR_wifi_pwd_sta),                    (mp_obj_t)&mod_pycom_wifi_pwd_sta_obj },
        { MP_OBJ_NEW_QSTR(MP_QSTR_wifi_pwd_ap),                     (mp_obj_t)&mod_pycom_wifi_pwd_ap_obj },
        { MP_OBJ_NEW_QSTR(MP_QSTR_wifi_mode_on_boot),               (mp_obj_t)&mod_pycom_wifi_mode_obj },
        { MP_OBJ_NEW_QSTR(MP_QSTR_ml_new_model),                    (mp_obj_t)&mod_pycom_ml_new_model_obj },
        { MP_OBJ_NEW_QSTR(MP_QSTR_ml_run_model),                    (mp_obj_t)&mod_pycom_ml_run_model_obj },

